[{"audio":{"path":"\/content\/myaudio_segments\/chunks_000.wav"},"text":"Your goal is to speak English fluently, like a native English speaker. In order to speak English fluently, you must think like a native English speaker. And today I am going to help you think and speak in English, like a native English speaker. Are you ready? Well, then I'm teacher Tiffany. Let's jump right in. All right. The very first thing you must do is think in English.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_001.wav"},"text":"So if someone asks you the question, what did you eat yesterday? You first need to start off by answering the five W's. You know it who, what, when, where, and why we are thinking and organizing our thoughts in English. So again, the question is what did you eat yesterday? So who me? What a burger and food.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_002.wav"},"text":"Fries. When last night at around 6. P.m. Where at red Robin. Why my friends wanted to meet up for dinner. Now what's happening is we're organizing all the bits and pieces of information in our mind so that we can answer the question like a native English speaker. It's very easy to answer the who, what, when, where, and why.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_003.wav"},"text":"Questions, right? You understand what you did, but after you organize your thoughts, you think in English, the next thing you need to do is actually speak. So how can we organize that information into an actual response? Here's how we do it. Using the exact information we looked at to answer the question. Once again, what did you eat yesterday? Here's the response last night. My friends hit me up. Yeah.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_004.wav"},"text":"Because they wanted to meet for dinner. It was around 6. P.m. So I was actually starving. We decided to meet at red Robin and I had a burger and fries. Now, everything I just said came from the first step thinking in English. Now, before I go into this a little bit more, I want to explain some of the expressions. Notice. I said, hit me.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_005.wav"},"text":"Up. Hit me up. Now this is kind of slang, an expression we use in English. So let me explain to you what this means to hit someone up right here. It's slang for contacting someone. For example, I'm recording this lesson for you. I'm teaching you right now, but right after this lesson, I need to hit my friend up. I need to contact my friend in English. We say.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_006.wav"},"text":"Hit someone up. So in the response, I said last night, my friends hit me up. Hey, Tiff. Hey, what's going on? We want to go out to eat. All right. Bet. Sure. I'll be there. My friends hit me up. They contacted me. Makes sense. Right? And the last one is starving. I said, I was actually starving, starving right here. It just means to be extremely hungry.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_007.wav"},"text":"You are looking everywhere for food. You're extremely hungry in English. We say starving. Good job. One more time after me. Starving. Excellent. So again, in step number one, we had to organize our thoughts. What did you eat yesterday? We answered the who, what, when, where, and why. Then step number two, the speak step. Now we are able to.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_008.wav"},"text":"Actually give our response using those five pieces of information. Last night, my friends hit me up because they wanted to meet up for dinner. It was around 6 PM. So I was actually starving. We decided to meet at red Robin and I had a burger and fries. Who, what, when, where, and why can all be found in this response? And you sound like a native English speaker when you include each of the five. W.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_009.wav"},"text":"You like that. Don't you? All right, let's move on to the next one. I want you to see that this applies to any question and any topic. So let's say for example, someone asks you to tell them about your best friend. Well, we have to start with the five W's who my best friend, Michelle, what? She tells amazing stories. When, whenever we hang out, where, and why.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_010.wav"},"text":"In my backyard. Why? She has the best memory as she knows how to make people laugh. Simple questions answered who, what, when, where, and why. Now, if you want to organize all of this information to sound like a native English speaker, this is how you would do it. Step two, the speak step. My best friend's name is Michelle. One of her best abilities is her.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_011.wav"},"text":"Or one of her best qualities is her ability to tell amazing stories. She has the best memory and she knows how to make people laugh. Whenever we hang out in my backyard, Michelle will start reminiscing about our younger days and go right into a story. Now that was a response that any native English speaker would have given, but look at the foundation of this.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_012.wav"},"text":"Response. The foundation of this response is simply right here. Oh, we have a little bit of overlap. There we go. The foundation of our response. Let's go and check it out right here. The foundation of our response is just right here. The five W's who, what, when, where, and why. Now I'm going to leave that part in there. It's okay. It happens. So again, remember when you are trying to sound like a native English speaker, you have to first.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_013.wav"},"text":"Step one, think in English, use the five W's who, what, when, where, and why to organize your thoughts. Once your thoughts are organized, then you can go directly into your response and sound like a native English speaker. Now in this response, you'll notice that there are three things that maybe you've never heard before, or maybe you don't understand. So I want to explain them. The first one is hang out. Hang out.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_014.wav"},"text":"Now hang out. This just means to spend time relaxing or socializing informally. Yeah. I'm just hanging out with my friends. You know, we're relaxing, just talking. We're just spending time together. It's an informal situation. We're relaxing and socializing in English. We say hang out. So I said, whenever we hang out, right now, the next thing I said was in my back yard.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_015.wav"},"text":"Back yard. Now, a backyard is literally just a yard or area of land behind a house or other building, typically surrounded by a fence. Right? So in America, we have our homes and behind our homes, there's this plot of grass and area. We call that area a backyard. So I said, we hang out, spend time together, socializing in my backyard. Okay.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_016.wav"},"text":"So I said, we hang out, spend time together, socializing in my backyard in the area behind my house. Makes sense, right? You're visualizing it. Now, the last thing I said that might've been a little bit tricky was reminisce. Now reminisce. This means to indulge in enjoyable recollection, remembering past events. Man, I remember when I was in high school, I'm reminiscing right now. I remember I could eat two sandwiches.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_017.wav"},"text":"Two large fries. I could eat a smoothie, a milkshake and not gain any weight. It's true. So I'm reminiscing again, indulging in enjoyable recollection, remembering of past events. Right? So now again, in step number one, we organized our thoughts to answer this question. Can you tell me about your best friend? We use the five W's who, what, when, where, and why. And we have that.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_018.wav"},"text":"We have this full response, a response that native English speakers would give in real life. Now, what if you were asked a different question? What about this question? How often do you exercise? Remember, as always, step one, we must organize our thoughts using the five W's. So how often do you exercise? Who? Me. What? Run. Run.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_019.wav"},"text":"Run. I'm going to answer the when. At the crack of dawn, Monday to Friday. Where? On the treadmill at the gym. Why? I can clear my mind. Now, remember, the question is how often do you exercise. But when you start organizing your thoughts, again, step number one, using the five W's, you start to get more information that will help you answer the question like a native English speaker. So what would that mean?","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_020.wav"},"text":"What would the answer look like using the five pieces of information? Here we go. Our response would be like this. I normally exercise Monday through Friday. In order to get it in before work, I wake up at the crack of dawn and head to the gym. While I'm running on the treadmill, I am able to clear my mind. This is an amazing response. It's not super long. But it includes each and every one of the five W's.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_021.wav"},"text":"All of the information is found in this response. Now, there's some new expressions that I want to explain to you. The first one is get it in. This is a phrasal verb and it can be slang sometimes as well. So let me explain what this means. Explain what this means. If you get something in, you manage to do it at a time when you are very busy doing other things. You manage to do something.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_022.wav"},"text":"Normally, I'm super busy in the morning. Normally, I don't have enough time. But I want to get it in before I go to work. Let me kind of squeeze it in right here in this spot. Again, if you get something in, you manage to do it at a time when you are very busy doing other things. Makes sense, right? Okay, the next thing is the crack of dawn. The crack of dawn. This just means a time very busy.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_023.wav"},"text":"Early in the morning. At daybreak or even before daybreak. Now, for me, I am an early bird. I wake up at the crack of dawn every day. Normally between 4 or 5 a.m. That's the normal time that I wake up. At the crack of dawn. Makes sense, right? Okay, and the next one was clear my mind. I said I'm able to clear my mind on the treadmill. When I'm running on the treadmill. To stop worrying or thinking about something.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_024.wav"},"text":"Maybe something happened at work. Maybe something happened with my family or my friends. Or maybe something is going on and it's really causing me a lot of stress. When I get on the treadmill, I'm able to clear my mind. To stop worrying or thinking about that thing. Makes sense, right? So again, if we look at the response. I normally exercise Monday through Friday. When? In order to get it in before work. I wake up at the crack of dawn and head to the gym.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_025.wav"},"text":"Why? Get it in before work. What do you do? When? Wake up at the crack of dawn. Where do you go? Heading to the gym. While I'm running on the treadmill, I'm able to clear my mind. We've answered each of the five W's. Who, what, when, where, and why. So again, if you want to speak English like a native English speaker. Just remember to think first. Using the five W's. Who, what, when, where, and why. And then speak. And you'll start sounding like me.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_026.wav"},"text":"Here we go. Using the five W's method. Who, what, when, where, and why. Let's look at this situation. Think. What are the students doing? So we have to use the five W's. The first W is who. We see a group of passionate students. Passionate students. What are they doing? They've organized a protest. When did this happen? Or when is it going to happen?","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_027.wav"},"text":"When will it happen? We've selected tomorrow. All right. Where is it going to happen? In front of city hall. And why is it going to happen? To demand better funding for education. What are we doing? We are organizing our thoughts. Remember, in order to speak English fluently, you must organize your thoughts in English using the five W's.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_028.wav"},"text":"Who, what, when, where, and why. So step one being think. We have thought about this. We have our five W's. How do we turn this into a fluent English response? Here's how we do it. Right here. Read it with me. Tomorrow, a group of passionate students will gather in front of city hall. They decided to organize this protest in order to demand better funding for education.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_029.wav"},"text":"This is an issue they believe needs immediate action. Now, what did we just do? We turned the information that we organized our thoughts. Who, what, when, where, and why we turned this information that we organized into a fluent English response. It's that simple using the five W's. Now I do want to break down some of the things that we need to do to make sure that we're doing this right. I want to break down some of these words for you.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_030.wav"},"text":"The first one is passionate. I want you to repeat after me this word passionate. Good again after me passionate. Excellent. Now passionate. It just means a strong enthusiasm or desire for something. A strong enthusiasm or desire for something. Remember? We said. Passionate students.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_031.wav"},"text":"They're enthusiastic. They had a strong desire, right? In English, we say passionate. Makes sense. All right. Now the second word was demand. Good again after me demand. Excellent. Now this word demand just means a strong request or requirement. Yes.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_032.wav"},"text":"A strong request or requirement. Listen again in our response, we said they decided to organize this protest in order to make a strong request for better funding for education. Again, they decided to organize this protest in order to demand better funding for education. Makes sense, right? Demand. Good. That's excellent. Excellent. Very good.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_033.wav"},"text":"So again, we first thought about the information. Again, the question was, what are the students doing? Who, what, when, where, and why? And it gave us this fluent English response. Now, can we apply this to another situation? What if we were asked this question? Hey, what are your daughter's plans? What are your daughter's plans? Well, once again, we're going to start with who, what, when, where, and why.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_034.wav"},"text":"The five W's. Here we go. Let's check this out again. Well, who are we talking about? My daughter and her friends. What? Planning a road trip. When? Next month. Where? From California to New York. Why? To explore new places and create lasting memories. Look what happened.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_035.wav"},"text":"We have the question and now we've organized our thoughts in English using the simple five W's method. Who, what, when, where, and why? So now with this information that we now have in answer to the question, how do we change this to actually be a fluent English response? So let's go back here. Here we go. My daughter and her friends are planning an adventure.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_036.wav"},"text":"An epic road trip from California to New York. Their plan is to leave next month, but they are still in the planning phase. They all want to explore new places and create lasting memories. A great response. A very, very natural and fluent English response. But notice once again, it has each of the five W's. Who, what, when, where, and why?","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_037.wav"},"text":"Remember when we were thinking about this question, what did we do? We organized the who, what, when, where, and why? So now having this response, now let's go a little bit deeper because there are new words and expressions that I want to make sure you understand. The first one being epic. Good. Again, after me, I want you to say it. Epic. Excellent. Now this just means grand.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_038.wav"},"text":"And noble in scale. Grand. Amazing. Something really awesome. In English, we say epic. So in the response, my daughter and her friends are planning an epic road trip. Not just a regular one. An epic, awesome, amazing road trip. Makes sense, right? In English, we say epic. What about the next one though? The next word is phase.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_039.wav"},"text":"Good. Again, after me. Phase. Great job. Now this just means a stage in the development of something. Once again, a stage in the development of something. Good. Now, when we made this response and we said it, we said it in this way. Their plan is to leave next month, but they are still in the planning phase.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_040.wav"},"text":"They are still in the planning stage. They're still developing. They're still planning. Makes sense, right? In English, we say phase. And the last one I want to look at is lasting memories. Good. Again, lasting memories. Great job. Now this just means memories that will remain in the mind for a long period of time.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_041.wav"},"text":"In English, we say lasting memories. For example, I still remember the very first time my mom made banana nut bread and I was four years old. Wee! It was good. That's a lasting memory. Something that remains for a long period of time. A memory that remains for a long period of time. Got it? Excellent. All right. So once again, we used the five W's.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_042.wav"},"text":"To give our response to this question. And we have a fluent English response. But can we still apply it to another question? Let's say, for example, someone asks you, how is your favorite sports team doing? Hey, how's your favorite sports team doing? Another question, right? You can always use the five W's. If you want to sound like a native English speaker, just remember the five W's method. Who?","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_043.wav"},"text":"A sports team. What? Training for a championship game. When? In two weeks. Where? At their home stadium. Why? To win the championship and bring pride to their city. We have everything organized in our mind, right? We know each W, the information for each W. So how can we turn this into a positive? Into a response. Check this out.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_044.wav"},"text":"My favorite sports team will be in a championship game at their stadium in two weeks. They are training hard for the championship game and pushing themselves to the limit because they want to win. This win will actually bring pride to their city. This response. It's amazing. Again, who, what, when, where, and why? Each of the five W's can be used. And each of the five W's can be found in this response.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_045.wav"},"text":"Now I do want to explain some of the words. Look at this first expression, pushing themselves to the limit. I want you to repeat after me. Pushing oneself to the limit. Excellent. Again, pushing oneself to the limit. Good job. Now this just means to strive to reach one's fullest potential.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_046.wav"},"text":"Challenge oneself in order to achieve a desired outcome. Challenging yourself, pushing yourself forward. You want to speak English fluently. So you're watching this lesson. You're letting me be your English teacher. You're letting me help you. And you're working hard to achieve that goal. You are pushing yourself, right? So pushing yourself to the limit means to your fullest potential. Makes sense, right? All right. Now, what about the other one? Pride.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_047.wav"},"text":"Good. Again, pride. Excellent. Now we'll read the response over again after we go over this word. Now this just means a feeling of pleasure or satisfaction in oneself for one's achievements. Like, ha ha, I did that. Yes, I know. I'm amazing. We say this is pride, right? So now check out the response, the response again. My favorite sports team will be in a championship.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_048.wav"},"text":"Game at their home stadium in two weeks. They are training hard for the championship game and pushing themselves to the limit because they want to win. Makes sense, right? And finally, this win will actually bring pride to their city. Makes sense, right? Excellent. I want you to remember this. No matter what the topic is, no matter what the question is, you can use the simple five W's method.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_049.wav"},"text":"Who, what, when, where, and why to answer any question and sound like a native English speaker. Now this simple method can be applied to any topic. I want us to start with this one right here. Imagine someone asked you, what did your friend do this morning? To be honest, a very simple question, right? Hey, what did your friend do this morning? But in order for you to answer this, like a native English speaker, to give a simple","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_050.wav"},"text":"a fluent response in English, you must use the five W's. So let's start with the first one. Who let's say your friend's name is Sarah. What Sarah went to the gym. I'm not going to lie to you this morning. I also went to the gym and I feel rejuvenated. All right. We'll get back to Sarah though. Again, we're answering the who, what, when, where, and why questions. Here we go.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_051.wav"},"text":"What about the, when this morning, where in her neighborhood, why to stay fit and healthy. Now at this point, we have answered each of the five W's who Sarah, what went to the gym when this morning, where in her neighborhood, why she wants to stay fit and healthy. Very simple pieces of information, right?","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_052.wav"},"text":"I'm sure you understood each and every piece of information. So how can we turn this into a fluent English response, a response that any native English speaker would give easily. Here's what it would look like using the five W's we just organized this morning. Sarah decided to prioritize her health.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_053.wav"},"text":"And fitness by heading to the gym in her neighborhood. Now don't worry. I'm going to teach you the new words as well. Let's continue. She told me that she went because she wants to stay fit and healthy. She understands the importance of exercise for both physical and mental wellbeing and is committed to making it a regular part of her routine. Each of the five W's.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_054.wav"},"text":"Is found in this response. When you are able to organize your thoughts using the five W's, you will also be able to give a response like a native English speaker. Each piece of information is found in this response. Now I want to quickly break down some of the words and the expressions. First, the word. Prioritize. Excellent. Again,","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_055.wav"},"text":"prioritize. Great job. Now this just means there we go right here to determine the order for dealing with a series of items or tasks according to their relative importance. For example, you might have five tasks to complete today at your job. But you know, writing the report is the most important one. You must finish. First.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_056.wav"},"text":"So you are prioritizing again, determining the order for dealing with a series of items or tasks according to their relative importance. Now I'm teaching you this word. I'm giving you the definition, but don't forget to download the app English with Tiffany. After this lesson, you can go and practice what I am teaching you. The new words, the new expressions and you.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_057.wav"},"text":"Yes, even what you're seeing as we go through the five W. So don't forget to download the English with Tiffany app. The link is in the description. You'll see for today's lesson so you can practice what you're learning. All right. Now, what about this next word? This next expression heading to good again, heading to great job. I said heading to the gym.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_058.wav"},"text":"Heading to actually just means moving or traveling towards a particular place or direction. Hey, you know that I love Indian food, but I also love Mexican food and there's a Mexican restaurant not too far from my office. So around lunchtime, I'm going to head to the Mexican restaurant. I'm going to move towards the restaurant. Going in that direction.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_059.wav"},"text":"You caught it, right? Excellent. In English, we say heading to or head to a certain place or in a certain direction. What about this one though? She wants to stay fit and healthy. What does fit mean? So after me first repeat after me fit. Excellent. Again, fit. Great job. Last time after me. Fit.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_060.wav"},"text":"Nice. Now this just means being in good physical condition or health in English. We say fit being in good physical condition. I was actually just talking to one of my friends. Our families are very close and I was looking at some pictures of him when he was extremely muscular. He was really fit his body. I couldn't honestly see any fat on his body. And he was telling me.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_061.wav"},"text":"What he went through in order to get so fit. So again, being in good physical condition or health in English, we say fit. Maybe you're fit right now. Here we go. Next. Well, being good again. Well, being great job. Now this just means the state of being comfortable, healthy, and happy.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_062.wav"},"text":"Well, being mentally, physically, you feel good. I think I right now have a good feeling. I'm experiencing a good vibes. I'm experiencing good health. You can tell I'm trying to show you right. Hey, mentally healthy, physically healthy. Again, like she said for both physical and mental well being. That's why she exercises.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_063.wav"},"text":"That's also one of the reasons why I exercise. It really helps your mental well being. You got it. Excellent. So again, we see, we use the five W's to give this response and answer to the question. What did your friend do this morning? And you see, we have heading to prioritize fit and wellbeing, new words and expressions. Don't forget again, in order for you to practice, you must download the app English with Tiffany right now.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_064.wav"},"text":"Right after this lesson, go to the app and practice what I am teaching you right now. Okay. The link is right in the description. Now, what if somebody asks you this question? Why did Michael buy a new car? Simple question, right? Hey, why did Michael buy a new car? You might say he wanted one. That is a correct answer. But remember, we're trying to get you to.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_065.wav"},"text":"To speak like a native English speaker to speak English fluently. So what do we need to do? You got it to apply the five W's who, what, when, where, and why? So the question, why did Michael buy a new car? So we have who Michael, what bought a new car when last week, where at a dealership? Why? Because his old car was no longer reliable. So.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_066.wav"},"text":"So we have each piece of information that we need. Who, what, when, where, and why? Very simple pieces of information. I want you to pay attention to the fact that the five W's method is actually very simple. Michael bought a new car last week at a dealership because his old car was no longer reliable. Now, how can we turn this into a response? Okay.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_067.wav"},"text":"A fluent English response. Check it out. Here we go. Michael bought a new car last week from a dealership already starting off. Good. His old car was no longer reliable. So he decided it was time for an upgrade. Michael is excited about his new purchase and feels more confident knowing he has a reliable means of transportation.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_068.wav"},"text":"That is an amazing response. Again, using the five W's that we organized and you understand them. This is how you are able to give a fluent English response when you use the five W's. Very simple, but it creates a very good response. Now in this response, just like last time, you'll see that there is a new word and a new expression.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_069.wav"},"text":"The word is reliable. Good. Again, after me. Reliable. Excellent. Last time after me. Reliable. Great job. Now this just means consistently good in quality or performance, able to be trusted. Makes sense. Now I'm going to use.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_070.wav"},"text":"An example. And I hope you agree with me. I think I am a reliable English teacher. I think my YouTube channel speak English with Tiffany is a reliable YouTube channel. Why? Because each week, every Sunday, I consistently upload an English lesson. I hope the quality meets your standards. I hope you enjoy the lessons. I think my channel is a reliable.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_071.wav"},"text":"English channel. Do you agree? You can answer. I can hear you. Thank you very much. So you understand the term reliable, right? Again, in the response, his old car was no longer reliable. You got it. Excellent. All right, here we go. The next one is means of transportation. Good.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_072.wav"},"text":"Again, means of transportation. Excellent. Last time after me means of transportation. Good. Again, please don't forget to practice when you, after this lesson, go to the app English with Tiffany, because it's important for you to practice this as well. You have some speech practice with this one too. Pronunciation. All right.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_073.wav"},"text":"It just means a vehicle or mode of travel used to move people or goods from one place to another. We just say means of transportation. My car is my means of transportation. Some people take the bus to work. Some people almost coughed there. Some people take the train means of transportation. And again, in the response at the very end.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_074.wav"},"text":"He feels more confident knowing he has a reliable means of transportation. You got it, right? Excellent. All right.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_075.wav"},"text":"Now, for the next lesson, I want you to look at the video and start thinking for yourself. Okay. What could I say now for the who Emily that's the response, but for the, what I said, watched a movie. You might say she's working on her computer again. I want you to start thinking. This is the first step in the process. Think and then speak when last night, where at home. Okay.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_076.wav"},"text":"Why? Because it was a new release. She had been looking forward to each of the five W's has been answered. No matter what the topic is, no matter what the question is, you can use the five W's to think in English and finally speak English fluently. So using our five W's, the information we organized, how can we speak English? Here's the response. Okay.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_077.wav"},"text":"Last night, Emily decided to chill at home and watch a movie. She was excited because it was a new release. She had been looking forward to after watching the movie. She hit me up and told me it was great. You like that, right? You like that for those watching, I had a little acting for you, but you see, we use the five W's who, what, when, where, and why.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_078.wav"},"text":"And we got a fluent English response. Now, even in this response, there are a few words and expressions that I want to explain and make sure you understand. The first one is chill up, not new release. Let's go to chill. I'll show you new release. Don't worry. Chill. Good. Again, chill. Excellent. Last time after me. Chill. Good.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_079.wav"},"text":"Great job. Now this just means to relax or take it easy to hang out in a casual and laid back way. I like to chill in the evenings. I'll lay on my couch, eat my dinner, maybe watch something on YouTube. Maybe talk to a friend. I just want to relax and take it easy. Makes sense, right? In English, we say chill. It's kind of a slang term. All right.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_080.wav"},"text":"Next we have now new release. Good. Again, new release. Excellent. Last time after me. New release. Great job. Now this just means a recently published or released work such as a book, a movie, or an album. Hey, I heard there's a new release. Do you want to go to the movie?","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_081.wav"},"text":"With me? Hey, I heard a new movie came out. Do you want to go to the movies with me? Makes sense, right? Good. In English, we say new release. Finally, the last sentence and the last sentence hit me up was said, hit me up. Good. Last time after me. Hit me up. Excellent.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_082.wav"},"text":"Now this just means a casual way of asking someone to contact you or get in touch with you. Hey, can you hit me up later? Hey, I'll hit you up tomorrow. Hey, can you call me later? Hey, I'll call you tomorrow. Now hit me up is also kind of a slang term, so you wouldn't use it in a professional environment, but you can use it with your family and friends. It just means to get in contact with someone. Hit me up.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_083.wav"},"text":"Did I make a quick sound? I'm ready. Hit me up or hit someone up. Makes sense. Excellent. So again, you see how we can use the five w's to speak English fluently about any topic in answer to any question, it can be used and it can change your English speaking ability. Now the lesson is not done. I need you once again, to download the English with Tiffany app.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_084.wav"},"text":"If you haven't already and go to the practice lessons for this one. All right. You're going to practice how to use the words, how to use the expressions and much more from our lesson today. All right. The very first thing we're going to look at is right here. Let's say someone asks you this question. What did he do right now? We are thinking about the question again, we're starting off first and foremost thinking in English.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_085.wav"},"text":"So if someone asks you this question, Hey, what did he do? You need to use the five W's method. Who, what, when, where, and why? So who are we speaking about? Let's say his name is John. What did he do? John bought a car. When? Did he buy the car yesterday? Now you see what we're doing, right?","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_086.wav"},"text":"We're just thinking about the question and picking out very simple pieces of information to answer each of the five W's. Now this information is going to enable you to speak English. So we have who we have, what, and we have when, where a dealership","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_087.wav"},"text":"in the downtown area and why to commute to work. So now we have each of the five W's answered who, what, when, where, and why? A simple method to answer the question. What did he do? So how can we take this information and turn it into a response that a native English speaker would give? Let's check out.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_088.wav"},"text":"The response, the speak step. Here we go. John made a significant investment yesterday when he bought a car, he purchased the car from a dealership downtown because he is going to start commuting to work. Listen, this right here is a very fluent English response to this question. And all we did was to first think in it.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_089.wav"},"text":"And then we took the five W's method. Who, what, when, where, and why, and each piece of information can be found in this response. Thinking in and then speaking English. Now there are a few words that I want to explain to you. The first one is significant. Now this word significant, it just means sufficiently great or important to be worthy of attention.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_090.wav"},"text":"Or noteworthy something that's important. Yes, this was a significant accomplishment, something worthy of focusing on. What did we say? He made a significant investment, a car. That's a very important purchase. You're investing a lot of money into a car thousands of dollars many times, right? So significant. Now, what about this last word? Significant.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_091.wav"},"text":"Commuting. What does that mean? The word is commute re added ING, right? But the word is commute and it just means to travel some distance between one's home and place of work on a regular basis. So we saw when we organized our five W's that this individual, John was purchasing a car. Why? Because he had to commute to work.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_092.wav"},"text":"Going from his home to his job on a regular basis. So he needed a car. Makes sense, right? So again, we have the five W's organized. We understand who John bought a car. What, when yesterday, when yesterday, where a dealership in the downtown area and why to commute to work. And we have our response. A perfect response in English.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_093.wav"},"text":"Makes sense, right? You're understanding this pattern and using this method to think in English and then speak, but it doesn't just work for this question. You can use it in every situation. Watch this. Let's say someone asks you this question. What did she do last night? So we have this individual. Who is it? Let's say her name is Sarah. What is she doing? She cooked past tense, a scrumptious dinner.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_094.wav"},"text":"Now don't worry. I will explain the meaning of the word scrumptious. I got you. Don't worry. But right now we're thinking in English, we're organizing our thoughts. So she cooked a scrumptious dinner when last night, where at home, why to celebrate her anniversary. You see, when we break it down, thinking in English, using the five W's, it immediately becomes so much. Much.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_095.wav"},"text":"Easier. So we have the information. Now we need to turn this information into a response that a native English speaker would give. So let's check out the response that includes each of the five W's. Here we go. Last night, Sarah cooked a scrumptious dinner at home for her husband. She decided to cook because she wanted to celebrate their anniversary. Each.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_096.wav"},"text":"Of the five W's can be found in this response. Who, what, when, where, and why? And if you give this response during an English exam, during a conversation, the person listening to you will be impressed. Why? Because it answers each of the five W's. Now I promised you that I would explain the word scrumptious. So this word scrumptious, it literally just means when speaking about food. Okay.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_097.wav"},"text":"Extremely tasty, very delicious. You've heard me tell you stories during story time about my mom's food. My mom cooks very well. Her food is always. Scrumptious. You got it again. Very tasty and delicious. Makes sense, right? Yes. This word is very commonly used. So you see that we can use the five W's to think in. English.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_098.wav"},"text":"About any topic about any question. And we finally are able to give a fluent English response, but maybe you're asking, Hey, Tiff, does it really work? I'm going to give you another example, another example, but don't forget again, after this lesson, remember to go to the app English with Tiffany app. The link is right in the description and this will help you. It will help you actually practice what you're learning. Download the app. The link is in the description. Okay.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_099.wav"},"text":"And this app will help you practice what you are learning weekly English fluency lessons with Tiffany. So you can watch this lesson and then go to the app and you can practice what you're learning. All right. So let's go to the third one to prove again, that this actually works. Here's the situation. Peter. The question is, Hey, where did Peter go? What do we need to do?","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_100.wav"},"text":"Yes. To think in English, we need to answer the five W. So here we go. Who we know we're talking about Peter. What attended a concert when last weekend, where at the stadium? Why? Because he is a huge fan of the band. So we have everything answered for the five W's. So simple thinking in English.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_101.wav"},"text":"We're making it easy. English does not have to be difficult. We know who, what, when, where, and why. So now we need to answer the question using the information that we just organized. So in order to use this information to organize it, this is what we need to say. Last weekend, Peter attended a concert. The concert was held at the stadium and he had an amazing experience.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_102.wav"},"text":"He had been anticipating the concert for weeks because he is a huge fan of the band that was playing. You liked that response too. Didn't you? I loved it. Why? Because we can find each of the five W's in this response. Who, what, when, where, and why. Now you'll also notice there are two words that we need to go over. The first one that I want to break down to you is anticipation. So.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_103.wav"},"text":"Anticipate. We said he had been anticipating the concert for weeks. What does anticipate mean? It just means to expect or predict. He was expecting the concert. He was looking forward to the concert. Ooh, I can't wait until the concert. Anticipate. Makes sense, right? Excellent. All right. The second one is actually a combination. So this expression, huge fan. Now huge just means very big.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_104.wav"},"text":"Or large, but a huge fan is used to emphasize that you are really a big fan. A really big fan of someone or something. Maybe you're my fan. Maybe you're a huge fan of teacher, Tiffany. I hope so. I love helping you, but you see again, it just emphasizes that you really love someone. You really are their fan in English. We say huge fan. So Peter.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_105.wav"},"text":"A huge fan of the band. So he was anticipating the concert. Makes sense, right? So again, we just use the five W's who, what, when, where, and why to think in English and then speak English. The very first thing I want us to look at is this situation right here. Someone has asked you a question. Do you like to travel? Now, as you were looking at that video, if you're looking at the video lesson, you probably started thinking about a vacation.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_106.wav"},"text":"Maybe you had in the past or maybe a vacation you want to go on in the future. But how do you answer this question? Simply you use the five W's method. Here we go. The very first thing you need to organize is who, who are we talking about? Me. What love to explore new cultures. When during summer vacations. What?","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_107.wav"},"text":"Where to exotic destinations. Why? Because it broadens my horizons and enriches my life. And I'm going to pause for a second. Right now we're doing the first step. We're thinking in English. The question is, do you like. To travel. Well, if we organize our ideas based on who, what, when, where, and why the five W's.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_108.wav"},"text":"We will actually be able to speak English fluently. And you can do the same each and every time someone asks you a question. So we have the information who, what, when, where, and why, but how can we turn this into a fluent English response? Here's what it will sound like. I love to explore new cultures during summer vacations. Usually.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_109.wav"},"text":"I travel to exotic destinations. The experience of immersing myself in unfamiliar customs, traditions, and languages broadens my horizons and enriches my life in countless ways. Now you're probably thinking to yourself, well, yes, Tiffany, that's an amazing response, but if you look closely, you'll realize within this response. That's me.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_110.wav"},"text":"That's right. I only used the information from the five W's who, what, when, where, and why that we organized in the first step. Thinking in English once again, who, well, we're talking about me, right? I love what, and we're just using the pieces of information from the first step. Love to explore new cultures during summer vacations to exotic destinations, because it","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_111.wav"},"text":"broadens my horizons. Now we see that the response is a fluent English response, but you'll also notice within the response that there's some new words. I want to explain the new words. The very first one is exotic. Good after me again, exotic. Excellent. Now this just means unusual or intriguing. Often associated.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_112.wav"},"text":"With foreign or unfamiliar places, cultures, or things. So this is a brand new word for you. Again, I use it like this. Usually I travel to exotic, unfamiliar destinations. You got it. Excellent. Now in the second one, well, the third sentence I said immersing. So what does the word immerse mean? Immerse oneself in someone.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_113.wav"},"text":"This is the expression using the word. So to immerse oneself in something, it just means to fully involve oneself in or become deeply absorbed in a particular activity, experience, or environment. For example, as your English teacher, I encourage you, even if you don't live in an English speaking country to immerse yourself in English.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_114.wav"},"text":"Watch YouTube videos, watch movies, listen to podcasts, immerse yourself, fully involve yourself. Makes sense, right? So again, in the sentence, the experience of immersing myself in unfamiliar customs, traditions, and languages. Dot, dot, dot. This brings us to the next expression. Broaden one's horizons. Listen, I hope you're taking notes.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_115.wav"},"text":"Because these are expressions and words that native English speakers use on a regular basis. So yes, I'm helping you think and speak English, but I'm also helping you start to sound like a native English speaker. Here we go. Broaden one's horizons. It means to expand one's knowledge, understanding, or experiences beyond what is familiar or conventional. What is the norm? Often.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_116.wav"},"text":"By exploring new perspectives or cultures. For example, prior to going to South Korea, I had only lived in America. I was very familiar with American culture, but when I moved to South Korea, I had to learn about a new culture. I had to understand new customs. My horizons were broadened. I started to understand people even more. Makes sense, right?","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_117.wav"},"text":"All right. Now this is the next expression. Enrich one's life. Enrich one's life. This just means to enhance or improve the quality depth or meaningfulness of one's life. Often through experiences, relationships, or personal growth. I always say that living in South Korea for such a long time enriched my life. I grew in South Korea.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_118.wav"},"text":"I learned so many ways, my perspectives, my actions, different habits. It really enriched my life. Makes sense. Excellent. All right. So we see again from this first example, thinking in English and then speaking English thinking by using the five W's who, what, when, where, and why. Okay. Tiffany. Yes. We were able to answer the question. Do you like to travel using the five W's? But is it really possible?","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_119.wav"},"text":"To use the five W's in every situation? Yes. Look at this question right here. Here's the question. Do you and your friends like to travel? Different situation. We're talking about travel, but now do you and your friends like to travel? How can we use the five W's who, what, when, where, and why to think in English and organize our thoughts? Here we go. Who my friends and I, what enjoy going on road trips. Who enjoy traveling.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_120.wav"},"text":"When on long weekends, where to scenic landscapes and national parks. Why? Because it allows us to disconnect from our daily routines and experience the beauty of nature. You see, when you use the five W's who, what, when, where, and why to organize your thoughts, all of a sudden the stress leaves. Why you're not thinking about, oh, how do I speak fluently? How do I sound like a native?","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_121.wav"},"text":"Speaker? No, you're focused on organizing your thoughts. You're smart. You're intelligent. Yes. I'm talking to you. You're already intelligent. I'm just giving you the tools you need to organize your thoughts and present them in English. So five W's for this question. We have who, what, when, where, and why to answer the question. Do you and your friends like to travel? What will this look like? Let's put it all together. My friends.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_122.wav"},"text":"And I enjoy going on road trips. We often travel to scenic landscapes and national parks during long weekends. You already recognize the five W's don't you? These adventures allow us to disconnect from our daily routines and experience the beauty of nature. My friend, I want you once again to think about the five W's we organized instead.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_123.wav"},"text":"Step one, all of the information from step one is in our response. And that's what makes it a fluent English response. Five W's each of the W's are answered in this response. All of the five W's are answered. Each one is seen in this response, but now let's take a step back and learn some of the words. We have some new words.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_124.wav"},"text":"In this response that I want to make sure you understand. The first one is scenic. Good again after me. Scenic. Excellent. Now this just means beautiful or picturesque, typically referring to natural landscapes, views, or settings that are visually appealing or aesthetically pleasing. I want you once again, if you're watching the video. To look at the video in the background, this video of this amazing. Video.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_125.wav"},"text":"This amazing national park. It's very scenic. This is how we use the word scenic, a picturesque, beautiful, natural landscape. Next. I want you to understand this word. Dis connect, disconnect. Now this means to break free, disengage from something often referring to detaching oneself from technology. We have our cell phones. We have our iPads. We have our computers.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_126.wav"},"text":"We have you're, things like this. The beautiful, beautiful nature. The better things to do so. This is your best solution for you and for yourself because if the word Harassment, you're trying to get away from something, you're nice to say that the word. This is your best. I'm not changing words in your head. And it's just your cause. I'm not saying any word, you're blank, blank, blank. I'm saying please stop. you improve.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_127.wav"},"text":"from work, whatever might be going on in English, we say disconnect. Makes sense. Right? Excellent. All right. So we see that we are able to use the five W's no matter what the question is. Now I want to remind you again, don't forget to download the app English with Tiffany, so that you can practice what you're learning. That's the most important thing practice after you learn. All right. So download the app totally for free. The link is in the description.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_128.wav"},"text":"Now I want us to look at this question, this question right here. Does he like to travel notice different questions, right? We're focusing now on someone else. Hey, does he like to travel? So now you're going to have to formulate your ideas based on someone else's experience, but we're still going to use the five W's method who, what, when, where, and why, so who he is.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_129.wav"},"text":"What seeks adventure and thrills when during school breaks, where to adrenaline pumping destinations, like bungee jumping spots and extreme sports. Centers. Why? Because it gives him an adrenaline rush and makes him feel alive. Again, we're just organizing our thoughts. Who, what, when, where, and why. And we're going to be talking about this in a little bit.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_130.wav"},"text":"Now we can speak English because our thoughts are already organized. Let's turn this actually into a fluent English response. Here's the response. He seeks adventure and thrills during school breaks. So he usually travels to adrenaline pumping destinations, like bungee jumping spots and extreme sports centers. The rush of adrenaline he experiences. Right?","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_131.wav"},"text":"From pushing his limits and engaging in exhilarating activities makes him feel. Truly alive. This is an amazing response. It sounds like a native English speaker. Why? Because we followed the first step, organizing our thoughts, who, what, when, where, and why now you'll also notice that within this response, there were quite a few new words and new expressions.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_132.wav"},"text":"So let's start with the first one. The first one I want to explain to you is thrill. Good again, thrill. Excellent. Now this just refers to a strong feeling right here. If you're looking at it of excitement, adrenaline, or exhilaration often derived from intense or risky activities or experiences, jumping out of a plane, riding a roller coaster thrill.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_133.wav"},"text":"The fact that your eyes get big, or you feel this rush of adrenaline in your body. Thrill. Next we have adrenaline pumping, adrenaline pumping. Now this just means something that causes a surge of adrenaline. That feeling that comes up inside of you typically associated with thrilling or high intensity activities that generate excitement and a heightened state of arousal.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_134.wav"},"text":"Adrenaline pumping, man, jumping out of a plane is an adrenaline pumping experience. The adrenaline just seems to pump, you know, when your heart beats fast, adrenaline pumping. Next we have push one's limits, push one's limits. Now this refers to going beyond one's comfort zone or usual capabilities, challenging oneself to reach new. Limits. Now this refers to going beyond one's comfort zone or usual capabilities, challenging oneself to reach new.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_135.wav"},"text":"Levels of physical, mental, or emotional performance or endurance. You my friend right now are pushing your limits. You might've felt before this video, man, it's so hard to think in English. It's so hard to speak English fluently, but now. As you're understanding, using simple methods can actually help you speak English fluently. You have this desire to push your limits, to go beyond what you thought you could do.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_136.wav"},"text":"Push one's limits. And finally we have exhilarating. Yes. A longer word again, exhilarating. Excellent. It just means producing intense feelings of excitement, exhilaration, the same word or joy often associated with thrilling or stimulating experiences that make one feel alive and energized. It's exhilarating and adrenaline pumping.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_137.wav"},"text":"It's an adrenaline pumping experience. Makes sense. Excellent. All right. So again, you're seeing how just thinking in English, using the five W's who, what, when, where, and why caused you caused us to produce this fluent English response. So my friend, I want you to remember as you're going on your English journey, don't forget to use the five W's who, what, when, where, and why. And I'll talk to you in the next lesson.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_138.wav"},"text":"You still there. You know what time it is? It's story time. Hey, I said it's story time. Let's do it again. Y'all story time. Hey, I said story time. I felt like singing it twice today. Here we go. So I want to tell you something that happened with my friend's son. Again, this is when I was in. South Korea. And my friend has two children.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_139.wav"},"text":"She has a six month old baby and she has a two year old boy. They're both boys. So the oldest one is two years old. And so every morning, you know, we'd all wake up. We talk a little bit. My friend and I would talk a little bit. The boys would kind of play on the floor and then we eat breakfast. So in this morning we ate breakfast and my friend and I decided just to keep talking. So the baby was just kind of in the baby chair. You know, relaxing.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_140.wav"},"text":"And the two year old was kind of just playing in the living room area. And then all of a sudden the two year old ran to my room. Now I was okay with him being in my room. I didn't even think anything of it. So my friend and I kept talking, but there's this thing, this thing that we all know when a child gets quiet, something's going on. So my friend and I were talking and two minutes went by. Three minutes went by. Five.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_141.wav"},"text":"Five minutes went by and I noticed that he was very quiet. So I said to my friend, one second, let me go check and see what he's doing. So I walked to the room that I was staying in at their apartment. And when I got to the door, I saw the little man sitting at the desk in my room and his back was towards me, but he just seemed so happy. So I called his name and he turned around. And his.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_142.wav"},"text":"His whole face was covered in lotion and his hands were covered in lotion. And he had the biggest smile on his face. Like, ta-da. Then I looked behind him. My entire computer was covered in lotion. My bag was. And my first thought was let's make sure he didn't eat the lotion. So I called my friends. Like, Hey, Hey, Hey, come, come. And I was calling her because of him. I was.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_143.wav"},"text":"Laughing because of the situation. So she thought I was worried about my computer. I was like, no, my computer outfit. It's fine. I'll wipe that off. Make sure he didn't eat the lotion. So she takes him to the bathroom and make sure he's still smiling in La La land. Just excited. She picks him up, takes him to the bathroom. I look at my desk. And I just laughed. I was like, children are amazing. They find joy in the simplest things. So I, when I wipe my computer off, like my bag off, everything was fine.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_144.wav"},"text":"But throughout the rest of my trip, I would periodically just start laughing, thinking about this little boy turning around as looking at me, hands covered in lotion, face covered in lotion, like. Hi auntie. So it's a reminder that sometimes we need to stop and just enjoy the simple things in life. I don't want you to wrap yourself in lotion, but children find joy in so many simple things. And as adults, sometimes we forget to find joy in the little things.","source":"0"},{"audio":{"path":"\/content\/myaudio_segments\/chunks_145.wav"},"text":"So today I hope just like that little man, you find joy in the simple things in life today. All right. I'll talk to you in the next lesson.","source":"0"}]